{
  "title": "Set theory",
  "obj": "Objective",
  "obj_content": "To verify distributive law for three given non-empty sets A, B and C, that is,",
  "Learning Outcome": "Learning Outcome",
  "Learning Outcome-1": "The student will understand the concepts of distributive law in set theory",
  "Learning Outcome-2": "The student will be able to use distributive law wherever required efficiently",
  "start": "Start",
  "instr_popup-1": "What are we going to learn?",
  "instr_popup-2": "We are going to verify the distributive law of set theory with three non-empty sets: A, B, and C.",
  "instr_popup-3": "Distributive law is A∪(B∩C) = (A∪B)∩(A∪C).",
  "instr_popup-4": "To verify the distributive law of set theory, we need to verify the relations of LHS and RHS.",
  "instr_popup-5": "For LHS the different relations are",
  "instr_popup-6": "Set",
  "instr_popup-7": "For RHS the different relations are",
  "ok": "ok",
  "cancel": "Cancel",
  "result": "Result",
  "toaster-1": "You haven't generate all the relations..!",
  "toaster-2": "Please click on LHS first..!",
  "line-2": "Set Theory Relations - LHS",
  "btn-1": "Draw Universal Set",
  "btn-2": "Draw Set A",
  "btn-3": "Set With Numbers",

  "toaster-3": "Please click on Draw Universal set..!",
  "toaster-4": "Relation A created successfully..!",
  "toaster-5": "Please generate the result..!",
  "btn-4": "Draw Set B",
  "btn-5": "Draw Set C",
  "line-3": "Wrong position of sets !!!",
  "toaster-6": "Relation B∩C created successfully !!!",
  "toaster-7": "Relation AU(B∩C) created successfully !!!",
  "toaster-8": "Wrong position of sets as sets are coinciding !!!",
  "line-4": "Set Theory Relations - RHS",
  "toaster-9": "Relation AUB created successfully !!!",
  "toaster-10": "Relation (A∪C) created successfully !!!",
  "toaster-11": "Relation (AUB)∩(AUC) created successfully !!!",
  "btn-6": "Restart",
  "line-5": "Distributive law verified",
  "instr-1": "To verify distributive law, We will first create Left Hand Side(LHS), for that click on LHS button.",
  "instr-2": "Click on the \"RHS\" button to start with the relations of RHS.",
  "instr-3": "Check whether all the checkboxes are ticked or not, if yes then",
  "instr-4": "Click on the \"RESULT\" button to redirect on result page.",
  "instr-5": "Click on the \"DRAW UNIVERSAL SET\" button to create a universal set.",
  "instr-6": "Click on the \"DRAW SET A\" button to create set A.",
  "instr-7": "Click on the \"SET WITH NUMBERS\" button for an example of a relation with numbers.",
  "instr-8": "OR",
  "instr-9": "Click on the \"NEXT\" button.",
  "instr-10": "Click on the \"DRAW SET B\" button to create set B.",
  "instr-11": "Click on the \"DRAW SET C\" button to create set C.",
  "instr-12": "Drag set B toward the dot appearing just before set C in such a way that the center of set B should get completely overlapped with the dot.",
  "instr-13": "Drag set A toward the dot appearing above (B∩C) in such a way that the center of set A should get completely overlapped with the dot.",
  "instr-14": "Drag set A toward the dot appearing just before the set B in such a way that the center of set A completely gets overlapped with the dot.",
  "instr-15": "Drag set A toward the dot appearing just before the set C in such a way that the center of set A completely gets overlapped with the dot.",
  "instr-16": "Drag set C toward the dot appearing just above the set (A∪B) in such a way that the center of set C completely gets overlapped with the dot.",
  "instr-17": "Hence proved.",
  "instr-18": "Observation",
  "instr-19": "We can observe that",
  "instr-20": "Click on the \"RESTART\" button to perform the activity again.",
  "instr-21": "Click on the \"SET WITH NUMBERS\" button for example of relation with numbers.",

  "theory-1": "Distributive Law",
  "theory-2": "Distributive Law states that the sum and product remain at the same value even when the order of the elements is altered.",
  "theory-3": "We will see the distributive property of sets using the Venn diagram. Before starting with the distributive property. Let's see some basic concepts of set theory.",
  "theory-4": "Venn Diagram",
  "theory-5": "A Venn diagram in math is used in logic theory and set theory to show various sets of data and their relationship with each other.",
  "theory-6": "Set Theory is a branch of mathematical logic where we learn sets and their properties. A set is a collection of objects or groups of objects.",
  "theory-7": "These objects are often called elements or members of a set. For example, a group of players in a cricket team is a set.",
  "theory-8": "Prerequisite Knowledge",
  "theory-9": "Null Set",
  "theory-10": "In mathematical sets, the null set, also called the empty set, is the set that does not contain anything.",
  "theory-11": "Non-Empty Set",
  "theory-12": "A nonempty set is a set containing one or more elements. Any set other than the empty set is called a non-empty set. Nonempty sets are sometimes also called nonvoid sets.",
  "theory-13": "A non-empty set containing a single element is called a singleton set.",
  "theory-14": "Union",
  "theory-15": "The union of two sets A and B is the set of all those elements which are either in A or B, i.e. A ∪ B",
  "theory-16": "Intersection",
  "theory-17": "The intersection of two sets A and B is the set of all common elements. The intersection of these two sets is denoted by A∩B.",

  "quiz-1": "Instructions for quiz",
  "quiz-2": "Read all instructions given below.",
  "quiz-3": "The quiz will start after clicking on the \"OK\" button, along with a timer.",
  "quiz-4": "To select an option as an answer to a given question click on it.",
  "quiz-5": "You will get two attempts to select the correct option to the question.",
  "quiz-6": "You may skip the question, if you want.",
  "quiz-7": "The score and timing are displayed on the top of the screen throughout the quiz.",
  "quiz-8": "You will get +1 for each correct answer. There is no negative marking.",
  "quiz-9": "The scorecard will be generated at the end of the quiz.",
  "quiz-10": "Welcome to Quiz",
  "que": "Question",
  "que-1": "Question Marks",
  "que-2": "Score",
  "que-3": "Previous",
  "que-4": "Submit",
  "que-5": "Next",
  "que-6": "Scorecard",
  "alert-1": "Explanation",
  "alert-2": "You Reached Maximum Attempts !!",
  "alert-3": "Please Attempt Next Question",
  "alert-4": "Please Try Again !!",
  "alert-5": "Wrong Answer !!!",
  "alert-6": "Correct Answer !!!",
  "score": "You Scored",
  "congo": "Congratulations ... !!!",
  "totalquestions": "Total no of Questions",
  "correctanswers": "Correct Answers",
  "wronganswers": "Wrong Answers",
  "partialattempts": "Partial Attempts",
  "unattempted": "Unattempted",
  "timetaken": "Time Taken",
  "min": "minutes",
  "seconds": "seconds",
  "Close": "Close",
  "quit": "Are you sure you want to quit?",
  "yes": "Yes",
  "selectoption": "Please select option !!!",
  "Theory": "Theory",
  "Vivavice": "Viva Voce",
  "help": "Help",
  "restriction_1": "Please click on LHS button.",
  "restriction_2": "Please click on RHS button."
}
